# Titanic Kaggle competition

Titanic datasets come from https://www.kaggle.com/c/titanic and is the most popular open kaggle competition.

It is my first real data set to practice data science skills. 

The work is done in jupyter and comes in stages:
1. Import and clean the data
2. feuture engineering to obtain new columns
3. basic statistics to recognize trends in data

Firstly I create environment by importing all neccesary packages.

In [1]:
import numpy as np
import pandas as pd

I saved files from website locally and read it from there.

In [2]:
train = r'C:\Users\Lenovo\PycharmProjects\Kaggle\Project1_Titanic\data\train.csv'
test = r'C:\Users\Lenovo\PycharmProjects\Kaggle\Project1_Titanic\data\test.csv'

train_data = pd.read_csv(train)
test_data = pd.read_csv(test)

## Kaggle Data description

In [4]:
pd.read_clipboard()

<div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>3f79e2f938e14de9c14ca18096300b037dd56cbe62f3c7a6</th>
    </tr>
  </thead>
  <tbody>
  </tbody>
</table>
</div>

### Train Data insights:
	1. 12 columns; 891 observations (Passengers)
	2. Each row is set to be different passenger.
	3. Null values: Age (177), Cabin (687), Embarked (2)
	4. Columns:
		4.1. PassengerId: Unique; int64
		4.2. Survived: [1, 0]; int64; 1:342 0:549
		4.3. Pclass: [1, 2, 3]; int64; 1:216 2:184 3:491
		4.4. Name: str; usually 'Surename, Title., Name(s)'
		4.5. Sex: ['female', 'male']; str; female:314 male: 577
		4.6. Age: float64; Year.0; min:0.42(under 1year decima; number) max:80
		4.7. SibSp: [0, 1, 2, 3, 4, 5, 8]; int64; 0:608 1:209 2:28 ...
		4.8. Parch: [0, 1, 2, 3, 4, 5, 6]; int64
		4.9. Ticket: str; possibly to del
		4.10. Fare: float64; min:0 max:512 mean:32
		4.11. Cabin: int64; maily 1st class (A##-E##); 147 obs; _possibly to del_
		4.12. Embarked: [C, Q, S]; possibly to del but S.survived = 217 S.notsurvived=417 maybe correlation with class

In [5]:
train_data.head(10)
#train_data.shape
#train_data.isnull().sum()
#train_data.dtypes
#train_data.PassengerId.is_unique
#train_data.groupby('Survived')['PassengerId'].count()
#train_data.groupby('Pclass')['PassengerId'].count()
#train_data.groupby('Sex')['PassengerId'].count()
#train_data.Age.describe(); train_data.sort_values('Age')
#train_data.groupby('SibSp')['PassengerId'].count()
#train_data.groupby('Parch')['PassengerId'].count()
#train_data.Fare.describe()
#train_data.groupby(['Pclass', 'Cabin'])['PassengerId'].count()
#train_data.groupby(['Embarked', 'Pclass'])['PassengerId'].count()

<div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>PassengerId</th>
      <th>Survived</th>
      <th>Pclass</th>
      <th>Name</th>
      <th>Sex</th>
      <th>Age</th>
      <th>SibSp</th>
      <th>Parch</th>
      <th>Ticket</th>
      <th>Fare</th>
      <th>Cabin</th>
      <th>Embarked</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>0</th>
      <td>1</td>
      <td>0</td>
      <td>3</td>
      <td>Braund, Mr. Owen Harris</td>
      <td>male</td>
      <td>22.0</td>
      <td>1</td>
      <td>0</td>
      <td>A/5 21171</td>
      <td>7.2500</td>
      <td>NaN</td>
      <td>S</td>
    </tr>
    <tr>
      <th>1</th>
      <td>2</td>
      <td>1</td>
      <td>1</td>
      <td>Cumings, Mrs. John Bradley (Florence Briggs Th...</td>
      <td>female</td>
      <td>38.0</td>
      <td>1</td>
      <td>0</td>
      <td>PC 17599</td>
      <td>71.2833</td>
      <td>C85</td>
      <td>C</td>
    </tr>
    <tr>
      <th>2</th>
      <td>3</td>
      <td>1</td>
      <td>3</td>
      <td>Heikkinen, Miss. Laina</td>
      <td>female</td>
      <td>26.0</td>
      <td>0</td>
      <td>0</td>
      <td>STON/O2. 3101282</td>
      <td>7.9250</td>
      <td>NaN</td>
      <td>S</td>
    </tr>
    <tr>
      <th>3</th>
      <td>4</td>
      <td>1</td>
      <td>1</td>
      <td>Futrelle, Mrs. Jacques Heath (Lily May Peel)</td>
      <td>female</td>
      <td>35.0</td>
      <td>1</td>
      <td>0</td>
      <td>113803</td>
      <td>53.1000</td>
      <td>C123</td>
      <td>S</td>
    </tr>
    <tr>
      <th>4</th>
      <td>5</td>
      <td>0</td>
      <td>3</td>
      <td>Allen, Mr. William Henry</td>
      <td>male</td>
      <td>35.0</td>
      <td>0</td>
      <td>0</td>
      <td>373450</td>
      <td>8.0500</td>
      <td>NaN</td>
      <td>S</td>
    </tr>
    <tr>
      <th>5</th>
      <td>6</td>
      <td>0</td>
      <td>3</td>
      <td>Moran, Mr. James</td>
      <td>male</td>
      <td>NaN</td>
      <td>0</td>
      <td>0</td>
      <td>330877</td>
      <td>8.4583</td>
      <td>NaN</td>
      <td>Q</td>
    </tr>
    <tr>
      <th>6</th>
      <td>7</td>
      <td>0</td>
      <td>1</td>
      <td>McCarthy, Mr. Timothy J</td>
      <td>male</td>
      <td>54.0</td>
      <td>0</td>
      <td>0</td>
      <td>17463</td>
      <td>51.8625</td>
      <td>E46</td>
      <td>S</td>
    </tr>
    <tr>
      <th>7</th>
      <td>8</td>
      <td>0</td>
      <td>3</td>
      <td>Palsson, Master. Gosta Leonard</td>
      <td>male</td>
      <td>2.0</td>
      <td>3</td>
      <td>1</td>
      <td>349909</td>
      <td>21.0750</td>
      <td>NaN</td>
      <td>S</td>
    </tr>
    <tr>
      <th>8</th>
      <td>9</td>
      <td>1</td>
      <td>3</td>
      <td>Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)</td>
      <td>female</td>
      <td>27.0</td>
      <td>0</td>
      <td>2</td>
      <td>347742</td>
      <td>11.1333</td>
      <td>NaN</td>
      <td>S</td>
    </tr>
    <tr>
      <th>9</th>
      <td>10</td>
      <td>1</td>
      <td>2</td>
      <td>Nasser, Mrs. Nicholas (Adele Achem)</td>
      <td>female</td>
      <td>14.0</td>
      <td>1</td>
      <td>0</td>
      <td>237736</td>
      <td>30.0708</td>
      <td>NaN</td>
      <td>C</td>
    </tr>
  </tbody>
</table>
</div>

### Test Data:
	1. 11 columns; 418 observations (Passengers)
	2. Each row is set to be different passenger.
	3. Null values: Age (86), Cabin (327), Fare (1)

In [6]:
test_data.head(10)
#test_data.shape
#test_data.isnull().sum()

<div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>PassengerId</th>
      <th>Pclass</th>
      <th>Name</th>
      <th>Sex</th>
      <th>Age</th>
      <th>SibSp</th>
      <th>Parch</th>
      <th>Ticket</th>
      <th>Fare</th>
      <th>Cabin</th>
      <th>Embarked</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>0</th>
      <td>892</td>
      <td>3</td>
      <td>Kelly, Mr. James</td>
      <td>male</td>
      <td>34.5</td>
      <td>0</td>
      <td>0</td>
      <td>330911</td>
      <td>7.8292</td>
      <td>NaN</td>
      <td>Q</td>
    </tr>
    <tr>
      <th>1</th>
      <td>893</td>
      <td>3</td>
      <td>Wilkes, Mrs. James (Ellen Needs)</td>
      <td>female</td>
      <td>47.0</td>
      <td>1</td>
      <td>0</td>
      <td>363272</td>
      <td>7.0000</td>
      <td>NaN</td>
      <td>S</td>
    </tr>
    <tr>
      <th>2</th>
      <td>894</td>
      <td>2</td>
      <td>Myles, Mr. Thomas Francis</td>
      <td>male</td>
      <td>62.0</td>
      <td>0</td>
      <td>0</td>
      <td>240276</td>
      <td>9.6875</td>
      <td>NaN</td>
      <td>Q</td>
    </tr>
    <tr>
      <th>3</th>
      <td>895</td>
      <td>3</td>
      <td>Wirz, Mr. Albert</td>
      <td>male</td>
      <td>27.0</td>
      <td>0</td>
      <td>0</td>
      <td>315154</td>
      <td>8.6625</td>
      <td>NaN</td>
      <td>S</td>
    </tr>
    <tr>
      <th>4</th>
      <td>896</td>
      <td>3</td>
      <td>Hirvonen, Mrs. Alexander (Helga E Lindqvist)</td>
      <td>female</td>
      <td>22.0</td>
      <td>1</td>
      <td>1</td>
      <td>3101298</td>
      <td>12.2875</td>
      <td>NaN</td>
      <td>S</td>
    </tr>
    <tr>
      <th>5</th>
      <td>897</td>
      <td>3</td>
      <td>Svensson, Mr. Johan Cervin</td>
      <td>male</td>
      <td>14.0</td>
      <td>0</td>
      <td>0</td>
      <td>7538</td>
      <td>9.2250</td>
      <td>NaN</td>
      <td>S</td>
    </tr>
    <tr>
      <th>6</th>
      <td>898</td>
      <td>3</td>
      <td>Connolly, Miss. Kate</td>
      <td>female</td>
      <td>30.0</td>
      <td>0</td>
      <td>0</td>
      <td>330972</td>
      <td>7.6292</td>
      <td>NaN</td>
      <td>Q</td>
    </tr>
    <tr>
      <th>7</th>
      <td>899</td>
      <td>2</td>
      <td>Caldwell, Mr. Albert Francis</td>
      <td>male</td>
      <td>26.0</td>
      <td>1</td>
      <td>1</td>
      <td>248738</td>
      <td>29.0000</td>
      <td>NaN</td>
      <td>S</td>
    </tr>
    <tr>
      <th>8</th>
      <td>900</td>
      <td>3</td>
      <td>Abrahim, Mrs. Joseph (Sophie Halaut Easu)</td>
      <td>female</td>
      <td>18.0</td>
      <td>0</td>
      <td>0</td>
      <td>2657</td>
      <td>7.2292</td>
      <td>NaN</td>
      <td>C</td>
    </tr>
    <tr>
      <th>9</th>
      <td>901</td>
      <td>3</td>
      <td>Davies, Mr. John Samuel</td>
      <td>male</td>
      <td>21.0</td>
      <td>2</td>
      <td>0</td>
      <td>A/4 48871</td>
      <td>24.1500</td>
      <td>NaN</td>
      <td>S</td>
    </tr>
  </tbody>
</table>
</div>

## Analyze Train set to test intuitive thoughts:
But furst let's check the amount of nulls
	1. Pclass has influence over Survived rate
	2. Sex --||--
	3. No of siblings --||--
	4. No of Parch --||--

In [3]:
print('-'*10, 'Number of Null Values for each dataset', '-'*10)
null_values = pd.concat([train_data.drop('Survived', axis=1).isnull().sum(), test_data.isnull().sum()], axis=1, keys=['Train', 'Test'])
null_values.query('Train !=0 | Test != 0')

---------- Number of Null Values for each dataset ----------

<div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>Train</th>
      <th>Test</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>Age</th>
      <td>177</td>
      <td>86</td>
    </tr>
    <tr>
      <th>Fare</th>
      <td>0</td>
      <td>1</td>
    </tr>
    <tr>
      <th>Cabin</th>
      <td>687</td>
      <td>327</td>
    </tr>
    <tr>
      <th>Embarked</th>
      <td>2</td>
      <td>0</td>
    </tr>
  </tbody>
</table>
</div>

In [4]:
print('-'*10, 'Survival Rate per class', '-'*10)
train_data.groupby('Pclass')['Survived'].mean()

---------- Survival Rate per class ----------

Pclass
1    0.629630
2    0.472826
3    0.242363
Name: Survived, dtype: float64

In [5]:
print('-'*10, 'Survival Rate per Gender', '-'*10)
train_data.groupby('Sex')['Survived'].mean()

---------- Survival Rate per Gender ----------

Sex
female    0.742038
male      0.188908
Name: Survived, dtype: float64

In [5]:
print('-'*10, 'Survival Rate per No of Siblings/Spouse', '-'*10)
train_data.groupby('SibSp')['Survived'].mean()

---------- Survival Rate per No of Siblings/Spouse ----------

SibSp
0    0.345395
1    0.535885
2    0.464286
3    0.250000
4    0.166667
5    0.000000
8    0.000000
Name: Survived, dtype: float64

In [6]:
print('-'*10, 'Survival Rate per No of Parents/Children', '-'*10)
train_data.groupby('Parch')['Survived'].mean()

---------- Survival Rate per No of Parents/Children ----------

Parch
0    0.343658
1    0.550847
2    0.500000
3    0.600000
4    0.000000
5    0.200000
6    0.000000
Name: Survived, dtype: float64

In [8]:
print('-'*10, 'Survival Rate per No of Embarked Port', '-'*10)
train_data.groupby('Embarked')['Survived'].mean()

---------- Survival Rate per No of Embarked Port ----------

Embarked
C    0.553571
Q    0.389610
S    0.336957
Name: Survived, dtype: float64

## Clean Train and Test databases:
###	1. Fill Na:
	* Age = by calculating typical age range(mean +/- std) of this Sex and PClass as Higher class had much higher Age
	* Embarked = by the most common Embarked location
	* Fare = by median Fare value
	* Cabin will converted to boolean by feature engineering

In [9]:
print('-'*10, 'Start train_data.Age filling', '-'*10)
age_stat = train_data.groupby(['Sex', 'Pclass'])['Age'].agg(['mean', 'std'])

age_stat['start'] = age_stat['mean'] - age_stat['std']
age_stat['end'] = age_stat['mean'] + age_stat['std']
age_stat.drop(['mean', 'std'], axis=1, inplace=True)

train_data = pd.merge(train_data, age_stat, how='left', left_on=['Sex', 'Pclass'], right_index=True)
train_data['Age2'] = train_data.apply(lambda x: np.random.randint(x.start, x.end), axis=1)
train_data.Age.fillna(train_data.Age2, inplace=True)
train_data.drop(['start', 'end', 'Age2'], axis=1, inplace=True)

if train_data.Age.isnull().sum() == 0:
    print('-'*10, 'Cleaning train_data.Age complete', '-'*10)
else:
    print('-'*10, 'Cleaning train_data.Age complete but there are still Null values', '-'*10)

---------- Start train_data.Age filling ----------
---------- Cleaning train_data.Age complete ----------

In [10]:
print('-'*10, 'Start test_data.Age filling', '-'*10)
age_stat = test_data.groupby(['Sex', 'Pclass'])['Age'].agg(['mean', 'std'])

age_stat['start'] = age_stat['mean'] - age_stat['std']
age_stat['end'] = age_stat['mean'] + age_stat['std']
age_stat.drop(['mean', 'std'], axis=1, inplace=True)

test_data = pd.merge(test_data, age_stat, how='left', left_on=['Sex', 'Pclass'], right_index=True)
test_data['Age2'] = test_data.apply(lambda x: np.random.randint(x.start, x.end), axis=1)
test_data.Age.fillna(test_data.Age2, inplace=True)
test_data.drop(['start', 'end', 'Age2'], axis=1, inplace=True)

if test_data.Age.isnull().sum() == 0:
    print('-'*10, 'Cleaning test_data.Age complete', '-'*10)
else:
    print('-'*10, 'Cleaning test_data.Age complete but there are still Null values', '-'*10)

---------- Start test_data.Age filling ----------
---------- Cleaning test_data.Age complete ----------

In [11]:
print('-'*10, 'Cleaning train.Embarkment', '-'*10)
train_data.Embarked.fillna(train_data.Embarked.mode()[0], inplace=True)
if train_data.Embarked.isnull().sum() == 0:
    print('-'*10, 'Cleaning train_data.Embarked complete', '-'*10)
else:
    print('-'*10, 'Cleaning train_data.Embarked complete but there are still Null values', '-'*10)

In [12]:
print('-'*10, 'Cleaning test_data.Fare', '-'*10)
test_data.Fare.fillna(test_data.Fare.median(), inplace=True)
if test_data.Fare.isnull().sum() == 0:
    print('-'*10, 'Cleaning test_data.Fare complete', '-'*10)
else:
    print('-'*10, 'Cleaning test_data.Fare complete but there are still Null values', '-'*10)

---------- Cleaning test_data.Fare ----------
---------- Cleaning test_data.Fare complete ----------

## Enigneer new features:
	1. Build a bool if passenger had a cabin
	2. Change Embarked to be a int
	3. Change Sex to be int
	4. Create Title from Name column
	5. IsAlone column has been created
	6. Delete Ticket and Fare columns

In [13]:
train_data['isCabin'] = train_data.Cabin.apply(lambda x: 1 if pd.isnull(x) == False else 0)
train_data.drop('Cabin', axis=1, inplace=True)

test_data['isCabin'] = test_data.Cabin.apply(lambda x: 1 if pd.isnull(x) == False else 0)
test_data.drop('Cabin', axis=1, inplace=True)

print('-'*10, 'isCabin column has been created', '-'*10)

---------- isCabin column has been created ----------

In [14]:
def emb_int(x):
    if x == 'C':
        return 3
    elif x == 'Q':
        return 2
    elif x == 'S':
        return 1
    else:
        return 0

train_data['Embarked'] = train_data.Embarked.apply(emb_int)
test_data['Embarked'] = test_data.Embarked.apply(emb_int)

Embarked_rep = {3: 'C', 2: 'Q', 1: 'S', 0: 'other'}
print('-'*10, 'Embarked has been motified to be represented as integer. Desc in Embarked_rep variable', '-'*10)

---------- Embarked has been motified to be represented as integer. Desc in Embarked_rep variable ----------

In [14]:
train_data['Sex'] = train_data.Sex.apply(lambda x: 1 if x == 'female' else 0)
test_data['Sex'] = test_data.Sex.apply(lambda x: 1 if x == 'female' else 0)

print('-'*10, 'Sex column has been modified. 1 is female; 0 is male', '-'*10)

---------- Sex column has been modified. 1 is female; 0 is male ----------

In [16]:
def Name_int(x):
    if 'Mr' in x or 'Master' in x or 'Rev' in x or 'Dr' in x or 'Capt' in x or 'Major' in x or 'Don' in x:
        return 1
    elif 'Mrs' in x:
        return 2
    elif 'Miss' in x:
        return 3
    else:
        return 0

train_data['Title'] = train_data.Name.apply(Name_int)
train_data.drop('Name', axis=1, inplace=True)
test_data['Title'] = test_data.Name.apply(Name_int)
test_data.drop('Name', axis=1, inplace=True)

Title_rep = {3: 'Miss', 2: 'Mrs', 1: ['Mr', 'Master', 'Rev', 'Dr', 'Capt', 'Major', 'Don'], 0: 'Other'}
print('-'*10, 'Title has been created from Name field. Desc in Title_rep variable', '-'*10)

---------- Title has been created from Name field. Desc in Title_rep variable ----------

In [16]:
train_data.drop('Ticket', axis=1, inplace=True)
train_data.drop('Fare', axis=1, inplace=True)

test_data.drop('Ticket', axis=1, inplace=True)
test_data.drop('Fare', axis=1, inplace=True)

print('-'*10, 'Ticket and Fare columns have been deleted', '-'*10)

---------- Ticket and Fare columns have been deleted ----------

In [18]:
train_data['isAlone'] = train_data.apply(lambda x: 1 if x.SibSp == 0 and x.Parch == 0 else 0, axis=1)
test_data['isAlone'] = test_data.apply(lambda x: 1 if x.SibSp == 0 and x.Parch == 0 else 1, axis=1)

print('-'*10, 'isAlone column has been created', '-'*10)

---------- isAlone column has been created ----------

In [19]:
train_data['AgeBuckets'], bins = pd.cut(train_data.Age, 6, labels=[1, 2, 3, 4, 5, 6], retbins=True)
test_data['AgeBuckets'] = pd.cut(test_data.Age, bins=bins, labels=[1, 2, 3, 4, 5, 6])
AgeBuckets = {1: [bins[0], bins[1]], 2: [bins[1], bins[2]], 3: [bins[2], bins[3]], 4: [bins[3], bins[4]], 5: [bins[4], bins[5]], 6: [bins[5], bins[6]]}
train_data.drop('Age', axis=1, inplace=True)
test_data.drop('Age', axis=1, inplace=True)

print('-'*10, 'Age Buckets created. Bins saved in variable= AgeBuckets.', '-'*10)

---------- Age Buckets created. Bins saved in variable= AgeBuckets. ----------

In [21]:
train_data['FamilySize'] = train_data.SibSp + train_data.Parch

print('-'*10, 'FamilySize has been created.', '-'*10)

---------- FamilySize has been created. ----------

In [22]:
train_data.drop('PassengerId', axis=1, inplace=True)
test_data.drop('PassengerId', axis=1, inplace=True)

print('-'*10, 'Passenger Id removed from datasets.', '-'*10)

---------- Passenger Id removed from datasets. ----------

## Advance analysis

In [42]:
train_data.groupby(['Sex', 'Title', 'Pclass'])['Survived'].describe()

<div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th></th>
      <th></th>
      <th>count</th>
      <th>mean</th>
      <th>std</th>
      <th>min</th>
      <th>25%</th>
      <th>50%</th>
      <th>75%</th>
      <th>max</th>
    </tr>
    <tr>
      <th>Sex</th>
      <th>Title</th>
      <th>Pclass</th>
      <th></th>
      <th></th>
      <th></th>
      <th></th>
      <th></th>
      <th></th>
      <th></th>
      <th></th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th rowspan="4" valign="top">0</th>
      <th>0</th>
      <th>1</th>
      <td>3.0</td>
      <td>0.333333</td>
      <td>0.577350</td>
      <td>0.0</td>
      <td>0.0</td>
      <td>0.0</td>
      <td>0.5</td>
      <td>1.0</td>
    </tr>
    <tr>
      <th rowspan="3" valign="top">1</th>
      <th>1</th>
      <td>119.0</td>
      <td>0.369748</td>
      <td>0.484778</td>
      <td>0.0</td>
      <td>0.0</td>
      <td>0.0</td>
      <td>1.0</td>
      <td>1.0</td>
    </tr>
    <tr>
      <th>2</th>
      <td>108.0</td>
      <td>0.157407</td>
      <td>0.365882</td>
      <td>0.0</td>
      <td>0.0</td>
      <td>0.0</td>
      <td>0.0</td>
      <td>1.0</td>
    </tr>
    <tr>
      <th>3</th>
      <td>347.0</td>
      <td>0.135447</td>
      <td>0.342694</td>
      <td>0.0</td>
      <td>0.0</td>
      <td>0.0</td>
      <td>0.0</td>
      <td>1.0</td>
    </tr>
    <tr>
      <th rowspan="8" valign="top">1</th>
      <th rowspan="2" valign="top">0</th>
      <th>1</th>
      <td>3.0</td>
      <td>1.000000</td>
      <td>0.000000</td>
      <td>1.0</td>
      <td>1.0</td>
      <td>1.0</td>
      <td>1.0</td>
      <td>1.0</td>
    </tr>
    <tr>
      <th>2</th>
      <td>1.0</td>
      <td>1.000000</td>
      <td>NaN</td>
      <td>1.0</td>
      <td>1.0</td>
      <td>1.0</td>
      <td>1.0</td>
      <td>1.0</td>
    </tr>
    <tr>
      <th rowspan="3" valign="top">1</th>
      <th>1</th>
      <td>45.0</td>
      <td>0.977778</td>
      <td>0.149071</td>
      <td>0.0</td>
      <td>1.0</td>
      <td>1.0</td>
      <td>1.0</td>
      <td>1.0</td>
    </tr>
    <tr>
      <th>2</th>
      <td>43.0</td>
      <td>0.883721</td>
      <td>0.324353</td>
      <td>0.0</td>
      <td>1.0</td>
      <td>1.0</td>
      <td>1.0</td>
      <td>1.0</td>
    </tr>
    <tr>
      <th>3</th>
      <td>43.0</td>
      <td>0.511628</td>
      <td>0.505781</td>
      <td>0.0</td>
      <td>0.0</td>
      <td>1.0</td>
      <td>1.0</td>
      <td>1.0</td>
    </tr>
    <tr>
      <th rowspan="3" valign="top">3</th>
      <th>1</th>
      <td>46.0</td>
      <td>0.956522</td>
      <td>0.206185</td>
      <td>0.0</td>
      <td>1.0</td>
      <td>1.0</td>
      <td>1.0</td>
      <td>1.0</td>
    </tr>
    <tr>
      <th>2</th>
      <td>32.0</td>
      <td>0.968750</td>
      <td>0.176777</td>
      <td>0.0</td>
      <td>1.0</td>
      <td>1.0</td>
      <td>1.0</td>
      <td>1.0</td>
    </tr>
    <tr>
      <th>3</th>
      <td>101.0</td>
      <td>0.495050</td>
      <td>0.502469</td>
      <td>0.0</td>
      <td>0.0</td>
      <td>0.0</td>
      <td>1.0</td>
      <td>1.0</td>
    </tr>
  </tbody>
</table>
</div>

In [44]:
train_data.pivot_table('Survived', index=['Sex', 'Pclass'], columns='FamilySize', margins=True)

<div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>FamilySize</th>
      <th>0</th>
      <th>1</th>
      <th>2</th>
      <th>3</th>
      <th>4</th>
      <th>5</th>
      <th>6</th>
      <th>7</th>
      <th>10</th>
      <th>All</th>
    </tr>
    <tr>
      <th>Sex</th>
      <th>Pclass</th>
      <th></th>
      <th></th>
      <th></th>
      <th></th>
      <th></th>
      <th></th>
      <th></th>
      <th></th>
      <th></th>
      <th></th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th rowspan="3" valign="top">0</th>
      <th>1</th>
      <td>0.333333</td>
      <td>0.387097</td>
      <td>0.454545</td>
      <td>1.000000</td>
      <td>NaN</td>
      <td>0.000000</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>0.368852</td>
    </tr>
    <tr>
      <th>2</th>
      <td>0.097222</td>
      <td>0.066667</td>
      <td>0.470588</td>
      <td>0.250000</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>0.157407</td>
    </tr>
    <tr>
      <th>3</th>
      <td>0.121212</td>
      <td>0.178571</td>
      <td>0.320000</td>
      <td>0.333333</td>
      <td>0.0</td>
      <td>0.000000</td>
      <td>0.250000</td>
      <td>0.0</td>
      <td>0.0</td>
      <td>0.135447</td>
    </tr>
    <tr>
      <th rowspan="3" valign="top">1</th>
      <th>1</th>
      <td>0.970588</td>
      <td>1.000000</td>
      <td>1.000000</td>
      <td>0.500000</td>
      <td>1.0</td>
      <td>1.000000</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>0.968085</td>
    </tr>
    <tr>
      <th>2</th>
      <td>0.906250</td>
      <td>0.894737</td>
      <td>0.928571</td>
      <td>1.000000</td>
      <td>1.0</td>
      <td>1.000000</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>0.921053</td>
    </tr>
    <tr>
      <th>3</th>
      <td>0.616667</td>
      <td>0.517241</td>
      <td>0.545455</td>
      <td>0.833333</td>
      <td>0.0</td>
      <td>0.000000</td>
      <td>0.375000</td>
      <td>0.0</td>
      <td>0.0</td>
      <td>0.500000</td>
    </tr>
    <tr>
      <th>All</th>
      <th></th>
      <td>0.303538</td>
      <td>0.552795</td>
      <td>0.578431</td>
      <td>0.724138</td>
      <td>0.2</td>
      <td>0.136364</td>
      <td>0.333333</td>
      <td>0.0</td>
      <td>0.0</td>
      <td>0.383838</td>
    </tr>
  </tbody>
</table>
</div>

In [45]:
train_data.pivot_table('Survived', index=['Sex', 'Pclass'], columns='FamilySize', aggfunc='count', margins=True)

<div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>FamilySize</th>
      <th>0</th>
      <th>1</th>
      <th>2</th>
      <th>3</th>
      <th>4</th>
      <th>5</th>
      <th>6</th>
      <th>7</th>
      <th>10</th>
      <th>All</th>
    </tr>
    <tr>
      <th>Sex</th>
      <th>Pclass</th>
      <th></th>
      <th></th>
      <th></th>
      <th></th>
      <th></th>
      <th></th>
      <th></th>
      <th></th>
      <th></th>
      <th></th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th rowspan="3" valign="top">0</th>
      <th>1</th>
      <td>75.0</td>
      <td>31.0</td>
      <td>11.0</td>
      <td>3.0</td>
      <td>NaN</td>
      <td>2.0</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>122</td>
    </tr>
    <tr>
      <th>2</th>
      <td>72.0</td>
      <td>15.0</td>
      <td>17.0</td>
      <td>4.0</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>108</td>
    </tr>
    <tr>
      <th>3</th>
      <td>264.0</td>
      <td>28.0</td>
      <td>25.0</td>
      <td>3.0</td>
      <td>3.0</td>
      <td>12.0</td>
      <td>4.0</td>
      <td>4.0</td>
      <td>4.0</td>
      <td>347</td>
    </tr>
    <tr>
      <th rowspan="3" valign="top">1</th>
      <th>1</th>
      <td>34.0</td>
      <td>39.0</td>
      <td>13.0</td>
      <td>4.0</td>
      <td>2.0</td>
      <td>2.0</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>94</td>
    </tr>
    <tr>
      <th>2</th>
      <td>32.0</td>
      <td>19.0</td>
      <td>14.0</td>
      <td>9.0</td>
      <td>1.0</td>
      <td>1.0</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>76</td>
    </tr>
    <tr>
      <th>3</th>
      <td>60.0</td>
      <td>29.0</td>
      <td>22.0</td>
      <td>6.0</td>
      <td>9.0</td>
      <td>5.0</td>
      <td>8.0</td>
      <td>2.0</td>
      <td>3.0</td>
      <td>144</td>
    </tr>
    <tr>
      <th>All</th>
      <th></th>
      <td>537.0</td>
      <td>161.0</td>
      <td>102.0</td>
      <td>29.0</td>
      <td>15.0</td>
      <td>22.0</td>
      <td>12.0</td>
      <td>6.0</td>
      <td>7.0</td>
      <td>891</td>
    </tr>
  </tbody>
</table>
</div>